public/man/man1/bluetoothctl-monitor.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - bluetoothctl-monitor.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - bluetoothctl-monitor.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>bluetoothctl-monitor - Monitor Submenu</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>bluetoothctl</strong> [–options] [monitor.commands]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
MONITOR COMMANDS
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
set-rssi-threshold
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>Set RSSI threshold parameter</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># set-rssi-threshold &lt;low_threshold&gt; &lt;high_threshold&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
set-rssi-timeout
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>Set RSSI timeout parameter</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># set-rssi-timeout &lt;low_timeout&gt; &lt;high_timeout&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
set-rssi-sampling-period
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>Set RSSI sampling period parameter</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># set-rssi-timeout &lt;low_timeout&gt; &lt;high_timeout&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
add-or-pattern
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>Register &#39;or pattern&#39; type monitor with the specified RSSI parameters</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># add-or-pattern [patterns=pattern1 pattern2 …]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
get-pattern
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>Get advertisement monitor</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># get-pattern &lt;monitor-id/all&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
remove-pattern
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<p>Remove advertisement monitor</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># remove-pattern &lt;monitor-id/all&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-10" class="outline-3">
<h3 id="headline-10">
get-supported-info
</h3>
<div id="outline-text-headline-10" class="outline-text-3">
<p>Get advertisement manager supported features and supported monitor types</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># get-supported-info</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-11" class="outline-3">
<h3 id="headline-11">
print-usage
</h3>
<div id="outline-text-headline-11" class="outline-text-3">
<p>Print the command usage</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># print-usage &lt;add-or-pattern&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-12" class="outline-2">
<h2 id="headline-12">
RESOURCES
</h2>
<div id="outline-text-headline-12" class="outline-text-2">
<p>&lt;http://www.bluez.org&gt;</p>
</div>
</div>
<div id="outline-container-headline-13" class="outline-2">
<h2 id="headline-13">
REPORTING BUGS
</h2>
<div id="outline-text-headline-13" class="outline-text-2">
<p>&lt;linux-bluetooth@vger.kernel.org&gt;</p>
</div>
</div>
<div id="outline-container-headline-14" class="outline-2">
<h2 id="headline-14">
COPYRIGHT
</h2>
<div id="outline-text-headline-14" class="outline-text-2">
<p>Free use of this software is granted under ther terms of the GNU Lesser
General Public Licenses (LGPL).</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
